# Customer Retention

In [1]:
# Load libraries 
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [2]:
import datetime as dt

In [3]:
# Libraries to connect to oracle database
import cx_Oracle as orc
import os
from sqlalchemy import types, create_engine

## Importing data from Oracle database

In [4]:
# Make DSN address
dsn = orc.makedsn('hostname', 'port', service_name='servicename')
# Connect to DSN
conn = orc.connect(user='username', password='password', dsn=dsn)

In [5]:
sql_query = """SELECT 
  CUSTOMER_ID,
  ORDER_NUMBER,
  TRUNC(ORDER_DATE) AS ORDER_DATE
FROM
  "DATABASE_NAME"."TABLE_NAME"
WHERE
  ORDER_DATE >= TO_DATE('01.09.18', 'DD.MM.YY')"""

In [6]:
# Read database table into dataframe 
original_df = pd.read_sql(sql_query, conn)

In [7]:
df1 = original_df.copy()

## Exploring data

In [8]:
df1.head(5)

                                CUSTOMER_ID  ORDER_NUMBER ORDER_DATE
0  35E35C3931A2386173A5D59EE2E48D2B859DAB83    1022018052 2019-03-21
1  C34D428EDC5FB9F558CE132215BE8244B3D0A3AB    1023380769 2019-03-21
2  4748CB3F832907E4E2C45DD2C4FEB455B1C7B1E2    1021856553 2019-03-21
3  22F10B8AB0FFF49B32382422E94EEEAA8EC3552B    1017334311 2019-03-21
4  5EB0A4E4BB63669B871129E40259D41F46F13147    1021947678 2019-03-21

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2531993 entries, 0 to 2531992
Data columns (total 3 columns):
CUSTOMER_ID     object
ORDER_NUMBER    int64
ORDER_DATE      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 58.0+ MB

In [11]:
pd.set_option('display.float_format','{:.2f}'.format) 
df1.describe(include='all')

,CUSTOMER_ID,ORDER_NUMBER,ORDER_DATE
count,2531270,2531993.00,2531993
unique,1907158,nan,327
top,7589A6204A355A86CED4C908DC9904488E5A9C9C,nan,2018-11-25 00:00:00
freq,420,nan,17075
first,NaN,nan,2018-09-29 00:00:00
last,NaN,nan,2019-08-25 00:00:00
mean,NaN,1015582822.64,NaN
std,NaN,41178916.52,NaN
min,NaN,521201305.00,NaN
25%,NaN,1005768604.00,NaN
50%,NaN,1019462113.00,NaN
75%,NaN,1032652318.00,NaN
max,NaN,1048497917.00,NaN

In [12]:
# Check for missing values
df1.isnull().sum()

CUSTOMER_ID     723
ORDER_NUMBER      0
ORDER_DATE        0
dtype: int64

In [13]:
# Drop missing data as ID is missing 
df1 = df1.dropna()

## Data Manipulation

Create fiscal year column as per company standards

In [14]:
df1['FY'] = 0

In [16]:
df1.loc[(df1['ORDER_DATE']>='2016-09-01') & (df1['ORDER_DATE']<'2017-09-01'), 'FY'] = 'FY17'
df1.loc[(df1['ORDER_DATE']>='2017-09-01') & (df1['ORDER_DATE']<'2018-09-01'), 'FY'] = 'FY18'
df1.loc[(df1['ORDER_DATE']>='2018-09-01') & (df1['ORDER_DATE']<'2019-09-01'), 'FY'] = 'FY19'
df1.loc[(df1['ORDER_DATE']>='2019-09-01') & (df1['ORDER_DATE']<'2020-09-01'), 'FY'] = 'FY20'

Manipulate data to find difference in days for subsequent purchases made by each of the customers over time. Orders made within 30 days span of time are supposed to be treated as one order.

In [18]:
# Arrange data in such a way that similar IDs are listed one after other in ascending date order 
df2 = df1.sort_values(['CUSTOMER_ID', 'ORDER_DATE'])

In [19]:
# Create copy of ID and date columns by shifting the original ordering one row down  
df2['CUSTOMER_ID_COPY'] = df2['CUSTOMER_ID'].shift(1)
df2['ORDER_DATE_COPY'] = df2['ORDER_DATE'].shift(1)

In [20]:
# Create a new column with value initialized to 5000
# This column is to store the number of days difference between successive orders placed by each of the customers 
df2['DATE_DIFF'] = 5000

In [21]:
# When ID matches, find difference between dates and store it in DATE_DIFF column 
df2.loc[df2['CUSTOMER_ID'] == df2['CUSTOMER_ID_COPY'], 'DATE_DIFF'] = (df2['ORDER_DATE'] - df2['ORDER_DATE_COPY']).dt.days

In [22]:
df3 = df2[df2['DATE_DIFF'] > 30]

In [23]:
df3.head(5)

,CUSTOMER_ID,ORDER_NUMBER,ORDER_DATE,FY,CUSTOMER_ID_COPY,ORDER_DATE_COPY,DATE_DIFF
1843758,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,1000631129,2018-11-27,FY19,NaN,NaT,5000.00
115902,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,1014957404,2019-02-17,FY19,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,2018-11-27,82.00
301097,000014CD9D292F6218080879889666A16E1EDA9F,1001214583,2018-11-22,FY19,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,2019-02-17,5000.00
119151,000014CD9D292F6218080879889666A16E1EDA9F,1016869811,2019-02-20,FY19,000014CD9D292F6218080879889666A16E1EDA9F,2018-11-22,90.00
830412,00001766AB0FF0DF74F82DC5BDDFBBC9DA26731D,1023913280,2019-04-02,FY19,000014CD9D292F6218080879889666A16E1EDA9F,2019-02-20,5000.00

In [24]:
df3 = df3.drop(['CUSTOMER_ID_COPY', 'ORDER_DATE_COPY'], axis=1)

In [25]:
# Convert the DATE_DIFF values that still has the default value - 5000 to null
df3.loc[df3['DATE_DIFF']==5000, 'DATE_DIFF'] = np.nan

Find cumulative count, to know the number of purchases made by each of the customers. Through this each of the purchase is identified if it is made by a repeat customer or not.

In [26]:
df3['REPEAT_TIME'] = df3.groupby('CUSTOMER_ID').cumcount() + 1

In [27]:
df3['REPEAT_TIME'].value_counts()

1    1907158
2     266270
3      53075
4      11732
5       2269
6        348
7         31
8          2
Name: REPEAT_TIME, dtype: int64

In [28]:
df3['REPEAT_CUST'] = 'Y'

In [29]:
df3.loc[df3['REPEAT_TIME']==1, 'REPEAT_CUST'] = 'N'

Identify repeat customers in a prospective way

In [30]:
df3['REPEAT_CUST_PROSPECTIVE']= df3.duplicated(subset=['CUSTOMER_ID'], keep=False)

In [31]:
df3.head(5)

,CUSTOMER_ID,ORDER_NUMBER,ORDER_DATE,FY,DATE_DIFF,REPEAT_TIME,REPEAT_CUST,REPEAT_CUST_PROSPECTIVE
1843758,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,1000631129,2018-11-27,FY19,nan,1,N,True
115902,000005FBDE326C41E4E704C8B358BF34E8EDFEA6,1014957404,2019-02-17,FY19,82.00,2,Y,True
301097,000014CD9D292F6218080879889666A16E1EDA9F,1001214583,2018-11-22,FY19,nan,1,N,True
119151,000014CD9D292F6218080879889666A16E1EDA9F,1016869811,2019-02-20,FY19,90.00,2,Y,True
830412,00001766AB0FF0DF74F82DC5BDDFBBC9DA26731D,1023913280,2019-04-02,FY19,nan,1,N,True

## Exporting data back to Oracle database

Now the dataset is ready in the desired format, so that it can be transferred back to Oracle database. From there it is connected to BI tool - Qlik Sense for visualizations and analysis by business users.

In [ ]:
conn1 = create_engine('oracle+cx_oracle://username:password@hostname:port/?service_name=servicename')

In [ ]:
df3.to_sql('table_name', conn1, if_exists='replace')